In [3]:
import pandas as pd

In [8]:
pwd #to see path location/directory

'C:\\Users\\a_ade\\Documents\\Coding Languages\\Python\\PandasPython'

# #“pandas read csv in other folder”

In [22]:
#“pandas read csv in other folder”

#df = pd.read_csv (r'C:\Users\a_ade\Downloads\weather.csv')
#df
#print(df.head(3)) # this is to only see first 3 columns

# #“pandas read csv in directory path , run pwd to check”

In [49]:
#df = pd.read_csv (r'C:\Users\a_ade\Documents\Spring2021\CSC 115\Python Project\titanic3.txt' , delimiter='\t')  
#remember when reading a txt file make sure to put the delimiter='\t'  so it wont look weird just like what is done above

df = pd.read_csv (r'C:\Users\a_ade\Documents\Spring2021\CSC 115\Python Project\titanic3.csv')  

#for now let's print only 5 rows to make it short
print(df.head(5))
#print(df.tail(5))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         0       1
2            3         0       3
3            4         0       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

# Reading Data in Pandas

In [34]:
## read headers
#print(df.columns)
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [71]:
##read each column 
#df['Name'][0:5]
# df['Sex'][0:5]
# df['Age'][0:5]

#multiple column
#print(df[['Name', 'Survived', 'Pclass']])

In [50]:
# read each row
print(df.iloc[1,4])

female

In [51]:
print(df.iloc[1]) #row integer location

PassengerId                                                    2
Survived                                                       0
Pclass                                                         1
Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
Sex                                                       female
Age                                                           38
SibSp                                                          1
Parch                                                          0
Ticket                                                  PC 17599
Fare                                                     71.2833
Cabin                                                        C85
Embarked                                                       C
Name: 1, dtype: object

In [54]:
#for index, row in df.iterrows():
 #   print(index, row['Name'] "")

In [61]:
df.loc[df['Name']=="Mamee, Mr. Hanna"]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
36,37,0,3,"Mamee, Mr. Hanna",male,34.0,0,0,2677,7.2292,NaN,C

In [62]:
#describe method , high level mean, standard deviations , count ,min max

df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,37.000000,37.0,37.000000,29.000000,37.000000,37.000000,37.000000
mean,19.000000,0.0,2.297297,29.758621,0.648649,0.486486,32.401911
std,10.824355,0.0,0.877650,16.500336,1.033232,1.216133,47.745553
min,1.000000,0.0,1.000000,2.000000,0.000000,0.000000,7.225000
25%,10.000000,0.0,1.000000,19.000000,0.000000,0.000000,8.029200
50%,19.000000,0.0,3.000000,31.000000,0.000000,0.000000,16.700000
75%,28.000000,0.0,3.000000,38.000000,1.000000,0.000000,31.275000
max,37.000000,0.0,3.000000,66.000000,4.000000,5.000000,263.000000

In [72]:
#sorting values

#df.sort_values('Name')
#df.sort_values('Name', ascending= False) #to descend it 
#df.sort_values(['Age'])

# Making changes to the data

In [87]:
#df.drop(columns=['Age']) #dropping a column

# df['Total'] = df.iloc[:, 4:7].sum(axis=1)
# cols = list(df.columns)
# df = df[cols[0:4] + [cols [-1]] + cols [4:13]]

#switching columns 

df = pd.read_csv (r'C:\Users\a_ade\Documents\Spring2021\CSC 115\Python Project\titanic3.csv')  

df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,0,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S